'''
For34. Дано целое число N (> 1). Последовательность вещественных чисел A K
определяется следующим образом:
A 1 = 1,
A 2 = 2,
A K = (A K−2 + 2·A K−1 )/3, K = 3, 4, . . . .
Вывести элементы A 1 , A 2 , . . . , A N .
'''

N = int(input("Введите N "))

while N <= 1:
	N = int(input("Введите N "))

A1 = 1
A2 = 2

print(A1)
print(A2)

Ak = 0.

for i in range(3,N+1):
	Ak = (A1 + 2 * A2) / 3
	print(Ak)
	A1 = A2
	A2 = Ak 