'''
For35. Дано целое число N (> 2). Последовательность целых чисел A K опре-
деляется следующим образом:
A 1 = 1,
A 2 = 2,
A 3 = 3,
A K = A K−1 + A K−2 − 2·A K−3 , K = 4, 5, . . . .
Вывести элементы A 1 , A 2 , . . . , A N .
'''

N = int(input("Введите N "))

while N <= 2:
	N = int(input("Введите N "))

A1 = 1
A2 = 2
A3 = 3

print('[1]-',A1)
print('[2]-',A2)
print('[3]-',A3)

Ak = 0.

for i in range(4,N+1):
	Ak = A3 + A2 - (2 * A1)
	print('[',i,']-',Ak)
	A1 = A2
	A2 = A3
	A3 = Ak