'''
Case14. Элементы равностороннего треугольника пронумерованы следую-
щим образом:
1 — сторона a, 2 — радиус R 1 вписанной окружности
√
(R 1 = a· 3/6), √
3 — радиус R 2 описанной окружности (R 2 = 2·R 1 ), 4 —
2
площадь S = a · 3/4. Дан номер одного из этих элементов и его значение.
Вывести значения остальных элементов данного треугольника (в том же
порядке)
'''

import math as m

print('1 - сторона a')
print('2 - R1')
print('3 - R2')
print('4 - площадь')

n = int(input("Введите номер: "))
while n > 4 or n < 1:
	n = int(input("Введите номер: "))

o = float(input("Введите переменную: "))

a = 0
R1 = 0
R2 = 0
S = 0

if n == 1:
	a = o
	R1 = a * (m.sqrt(3) / 6)
	R2 = 2 * R1
	S = a*a * ((m.sqrt(3) / 4))

elif n == 2:
	R1 = o
	a = (R1 * 6) / (m.sqrt(3))
	R2 = 2 * R1
	S = a*a * ((m.sqrt(3) / 4))

elif n == 3:
	R2 = o
	R1 = R2 / 2
	a = (R1 * 6) / (m.sqrt(3))
	S = a*a * ((m.sqrt(3) / 4))

elif n == 4:
	S = o
	a = m.sqrt((4 * S)/(m.sqrt(3)))
	R1 = a * (m.sqrt(3) / 6)
	R2 = 2 * R1

print('сторона a ',a)
print('R1 ',R1)
print('R2 ',R2)
print('площадь ',S)
