'''
Begin13 ◦ . Даны два круга с общим центром и радиусами R 1 и R 2 (R 1 > R 2 ).
Найти площади этих кругов S 1 и S 2 , а также площадь S 3 кольца, внешний
радиус которого равен R 1 , а внутренний радиус равен R 2 :
S 1 = π·(R 1 ) 2 , S 2 = π·(R 2 ) 2 , S 3 = S 1 − S 2 .
В качестве значения π использовать 3.14.
'''
import math as m

r1 = int(input("Введите r1: "))
while r1 == 0:
    r1 = int(input("Введите r1: "))
    
r2 = int(input("Введите r2: "))
while r2 == 0:
    r2 = int(input("Введите r2: "))

while r1 < r2:
    print("r1 < r2")
    r1 = int(input("Введите r1: "))
    r2 = int(input("Введите r2: "))

s1 = m.pi * pow(r1,2)
s2 = m.pi * pow(r2,2)
s3 = s1 - s2

print("s1 = ",s1)
print("s2 = ",s2)
print("s3 = ",s3)
